app/controllers/blogs_controller.rb

SELECT * FROM "blogs" WHERE ("blogs"."author" = 'taylor.carr') LIMIT 1
---
  def index

    #puts current_user.username
    @has_blog = Blog.find_by_author(current_user.username)

SELECT * FROM "blogs" WHERE ("blogs"."id" = 1) LIMIT 1
---
  def show
    @blog = Blog.find(params[:id])

SELECT * FROM "blogs" WHERE ("blogs"."id" = 1)
---
  def edit
    @blog = Blog.find(params[:id])

INSERT INTO "blogs" ("created_at", "author", "title", "updated_at") VALUES('2009-11-20 01:58:11', 'taylor.carr', 'Tate''s first blog', '2009-11-20 01:58:11')
---
  def create
    @blog = Blog.new({:author => current_user.username, :title => params[:blog][:title]})

    respond_to do |format|
      if @blog.save

SELECT * FROM "blogs" WHERE ("blogs"."id" = 2)
---
  def update
    @blog = Blog.find(params[:id])