app/controllers/comments_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 3) LIMIT 1
INSERT INTO "comments" ("created_at", "body", "author", "updated_at", "post_id") VALUES('2009-11-20 02:30:15', 'It sure did.', NULL, '2009-11-20 02:30:15', 2)
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create!({:author => current_user.username, :body => params[:comment][:body]})

SELECT * FROM "comments" WHERE ("comments"."id" = 10)
DELETE FROM "comments" WHERE "id" = 10
SELECT * FROM "posts" WHERE ("posts"."id" = 2) LIMIT 1
---
  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy

    redirect_to Post.find_by_id(@comment.post_id)