app/controllers/posts_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 3) LIMIT 1
SELECT * FROM "blogs" WHERE ("blogs"."id" = 1) LIMIT 1
---
  def show
    @post = Post.find(params[:id])
    @blog = Blog.find_by_id(@post.blog_id)

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
---
  def edit
    @post = Post.find(params[:id])

SELECT * FROM "blogs" WHERE ("blogs"."author" = 'taylor.carr') LIMIT 1
INSERT INTO "posts" ("created_at", "title", "body", "updated_at", "blog_id") VALUES('2009-11-20 02:23:51', 'My first post', 'I really hope this works, cause I think I''m just figuring it all out.', '2009-11-20 02:23:51', 1)
---
  def create
    @blog = Blog.find_by_author(current_user.username)
    @post = Post.new({:blog_id => @blog.id, :title => params[:post][:title], :body => params[:post][:body]})

    respond_to do |format|
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "updated_at" = '2009-11-13 00:22:43', "title" = 'Preamble
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])

SELECT * FROM "posts" WHERE ("posts"."id" = 5)
DELETE FROM "posts" WHERE "id" = 5
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy